<template>
<div class="aboutMe">
<h1>🌱 About me</h1>
<div class="profile">
  <div class="profileText">
    <h2>山岸真悠子（Mayuko Yamagishi）</h2>
    <p>1997年5月22日生まれ、現在25歳。大学卒業後は、医薬品メーカーの営業事務として営業のアシスタント業務に従事。また国内外の新販路開拓も担当している。<br>2021年11月より独学でプログラミング学習を開始。趣味は読書とテニス。14歳の時にアメリカにホームステイした経験から、将来は海外で働くことに憧れている👀✨</p>
  </div>
  <img src="~/assets/img/profile.jpeg" width="300px">
</div>

<div class="history">
  <h2>経歴</h2>
    <h3>2020年3月 　フェリス女学院大学文学部　卒業</h3>
    <h3>2020年10月　株式会社大和生物研究所　入社</h3>
      <P>　現職ではInstagramにてインフルエンサーを起用した製品PRを行なっています。これまで委託業者を通してInstagramにてインフルエンサーPRを行っていましたが、反響があまりなかったことや会社が求めるインフルエンサーの属性でないことが気になり、「私が直接インフルエンサーを探し、価格も含めて交渉しても良いですか？」と上司に提案したところ、「面白そうだからやってみては？」と承諾を得ることができました。喜びと同時に「絶対結果を出してみせる」という熱い気持ちが湧き上がってきました。<br>そこで属性のあったインフルエンサーを起用し、どんな投稿の反応が良いか分析していった結果、約半年で前年売上を達成することができました。</P>
    <h3>現在転職活動中</h3>
</div>

<div class="skill">
  <h2>学習したプログラミングスキル</h2>
  <p text-aligin="center">フロントエンドを中心に学習を行なっております。</p>
  <p>HTML, CSS, JavaScript, Ruby, Ruby on Rails（APIモード）, Vue.js / Nuxt.js, Vuetify, Firebase, Netlify, MySQL, AWS（VPC・EC2・RDS・S3・ELB・CloudFront・IAM・Route53・ACM）, Git/GitHub</p>
</div>

<div class="will1">
  <h2>どのような業務に携わりたいか</h2>
  <p>ユーザーがノンスキルでも自らで課題を解決できるサービスが作りたいです。<br>特別なスキルがなくても、ITを使って「できること」を増やしていきたいです。そしてITはITが得意な人だけのものではないことを広め、ITの民主化を実現していきたいです。</p>
</div>

<div class="will2">
  <h2>どのようなエンジニアになりたいか</h2>
  <p>ユーザーの「もっとこうだったらいいのに」を叶え、夢や課題解決のサポートができるエンジニアになりたいです。</p>
</div>

<div class="pr">
  <h2>自己PR</h2>
  <p>1. 主体的に考え、行動する力<br>---------------------------------------------------------</p>
  <p>現職ではコロナにより海外視察ができず、海外企業とのコネクションが一件もない状態が続いていました。そこでコストを圧倒的に抑えた上で、オンライン展示会であるAlibaba.comへの出展を提案・実行しました。約半年で3社と商談を終えており、海外での新販路開拓をゼロから一歩前へ進めることができました。</p>
  <p>2. チームワーク力<br>---------------------------------------------------------</p>
  <p>チームメンバーを巻き込んで目標に立ち向かう力があります。<br>現在エンジニア志望の女性コミュニティを運営しています。目的はプログラミング学習を習慣化すること、そして女性の「エンジニアになる」という選択肢を当たり前にすることです。それぞれが違う状況下でも、全員がコミットできるチームワークを目標にして活動しています。
</p>
  <p>3. コミット力<br>---------------------------------------------------------</p>
  <p>やると決めた事には徹底的にコミットできる力があります。<br>プログラミング学習は2021年11月より毎日継続しております。平日は最低でも4時間、休日は10時間を目標とし、週平均50時間を継続しています。所属しているプログラミングコミュニティでも「バイタリティおばけ」と言われたことがあり、コミット量には自負しております。</p>

</div>
</div>
</template>

<script>
export default {

}
</script>

<style>
h2 {
  text-align: center;
  
}
.aboutMe {
  /* background-image:url(./assets/img/back.png); */
}
.about > h1 {
  margin-top: 100px;
}
.profile {
  margin-bottom: 100px;
}
.profile, .history, .skill, .will1, .will2, .pr {
  margin-bottom: 80px;
  margin-left: 100px;
  margin-right: 100px;
}
.profile {
  display: flex;
}
.profileText {
  margin: 20px;
}
.profileText h2 {
  color: #BF4E1A;
}
.profileText p {
  margin: 20px;
}

</style>