<template>
<div class="passion" id="passion">
  <h1>Passion</h1>
  <div class="will">
    <h2>なぜエンジニアになりたいのか</h2>
    <p><b>ユーザーにとことん寄り添ったサービスで課題解決をサポートしたいからです。</b>です。</p>
    <p>私がITに魅力を感じるようになったのは、現職で社内連絡ツールとして使用しているサイボウズOfficeがきっかけです。目的に合わせたアプリがノンプログラミングで簡単に作れるといった柔軟性に<font color="#FF1616"><b>「ここまでユーザーに合わせてカスタマイズできるなんて凄い！」と感動</b></font>し、そこからITに興味が引かれるようになりました。</p>
    <p>一方で私が担当するECの受注システムでは、部分毎に使用するサービスが違うためそれぞれが独立しており、連携が取れない部分を補うために手動で対応しています。システムを委託している会社に相談しても「改善は難しい」と言われてしまい、「もっとこうだったら良いのに」というアイデアが思い浮かんでも自分にはスキルがないため、<font color="#FF1616"><b>既存のシステムに甘んじることしかできないのが勿体無いし悔しい</b></font>と思うようになりました。</p>
    <p>そこから自分の理想のサービスを作りたいという気持ちが次第に強くなり、学生時代にプログラミングを学んでいたこともあって、「もっと会社に合わせたECサイトが作れるのではないか」と、再び勉強を始めました。</p>
    <p>私がサイボウズで体験した感動を増やしていくために、仕様だから諦めざるを得ないシステムではなく、ユーザーの課題にとことん寄り添ったパーソナライズなサービスを社会に提供していきたいと考えたため、エンジニアへの転職を決意しました。</p>
  </div>

  <div class="will">
    <h2>どのような業務に携わりたいか</h2>
    <p><b>ユーザーがノンスキルでも自らで課題を解決できるサービスが作りたい</b>です。</p>
    <p>私がやりがいを感じるのは「誰かの課題解決のサポートができたとき」です。<br>
    営業事務として働く中で、顧客に「オリジナルシールを作って欲しい」と、特異な依頼を受けたことがありました。そこで私は、デザインは素人ながらもCanvaを使ってなんとかシールを完成させました。すると顧客に凄く喜ばれ、「引き受けて良かった」と心から思うと同時に、<font color="#FF1616"><b>素人でもプロ並みのデザインが簡単に作れてしまうITの力に驚きを感じました。</b></font></p>
    <p>この経験から<font color="#FF1616"><b>「ITがあればノンスキルでもユーザー自らで課題を解決できる状態が作れるんだ」と感銘を受け、</b></font>自分もそんなサービスを提供し、誰かの課題解決のサポートができるようになりたいと考えるようになりました。特別なスキルがなくても、ITを使って「できること」を増やし、<font color="#FF1616"><b>ITはITが得意な人だけのものではないことを広め、ITの民主化を実現</b></font>していきたいです。</p>
    <p>この思いを実現するためにも、</p>
    <p>・ITの技術をもって、ノンスキルでもユーザー自らで課題を解決できるサービスを作る<br>
       ・ユーザーに寄り添えるパーソナライズなサービスを下流工程だけでなく上流工程も担当する<br>
       ・仕様書通りの実装だけでなく、自らのアイデアを実装できるようになる
    </p>
    <p>ということを実現できるエンジニアになりたいです。</p>
  </div>

</div>
</template>

<script>
export default {

}
</script>

<style>
.will {
  margin-bottom: 80px;
  margin-left: 100px;
  margin-right: 100px;
}
</style>